USER_TYPE = {
    0: 0,  # دانشجو
    1: 1  # استاد
}

STUDENT_TYPE = {
    0: 0,  # روزانه
    1: 1,  # شبانه
    2: 2,  # مجازی
    3: 3  # پردیس
}

PROFESSOR_STATUS = {
    0: 0,  # استادیار
    1: 1,  # دانشیار
    2: 2  # استاد تمام
}

PROFESSOR_RESPONSIBILITIES = {
    0: 0,  # استاد راهنما
    1: 1  # مدیر گروه
}

PROFESSOR_DEGREE = {
    0: 0,  # دکتری
    1: 1  # پست دکتری
}

PROFESSOR_GROUP = {
    0: 0,  # نرم افزار و سیستم های اطلاعاتی
    1: 1,  # معماری سامانه کامپیوتری
    2: 2  # هوش مصنوعی، رباتیک و رایانش شناختی
}

DEFEND_DAY_RESULT = {
    0: 0,  # تایید
    1: 1,  # اصلاح جزئی
    2: 2,  # اصلاح کلی
    3: 3  # تبدیل به آموزش محور
}

PROPOSAL_STATE = {
    0: 0,  # ثبت اولیه
    1: 1,  # بررسی آنلاین پروپوزال
    2: 2,  # نیاز به تغییرات
    3: 3,  # برگزاری جلسه دفاع
    4: 4,  # اصلاح کلی
    5: 5,  # اصلاح جزئی
    6: 6,  # تایید شورا
    7: 7,  # نیازمند انجام اصلاحات
    8: 8,  # تایید
    9: 9   # تبدیل به آموزش-محور
}

RESEARCH_TYPE = {
    0: 0,  # بنیادی
    1: 1,  # نظری
    2: 2,  # کاربردی
    3: 3,  # توسعه ای
}

CHECKING_RESULT = {
    0: 0,  # تایید
    1: 1,  # تبدیل به آموزش-محور
    2: 2  # نیاز به تغییرات
}

COUNCIL_FINAL_RESULT = {
    0: 0,  # تایید
    1: 1,  # تبدیل به آموزش-محور
}